MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ2025DAR169/mcu.h
#define _GLCDCLUT10_BLUE_POSITION                0x00000000
#define _GLCDCLUT10_BLUE_MASK                    0x000000FF
#define _GLCDCLUT10_BLUE_LENGTH                  0x00000008

#define _GLCDCLUT10_GREEN_POSITION               0x00000008
#define _GLCDCLUT10_GREEN_MASK                   0x0000FF00
#define _GLCDCLUT10_GREEN_LENGTH                 0x00000008

#define _GLCDCLUT10_RED_POSITION                 0x00000010
#define _GLCDCLUT10_RED_MASK                     0x00FF0000
#define _GLCDCLUT10_RED_LENGTH                   0x00000008

#define _GLCDCLUT11_BLUE_POSITION                0x00000000
#define _GLCDCLUT11_BLUE_MASK                    0x000000FF
#define _GLCDCLUT11_BLUE_LENGTH                  0x00000008

#define _GLCDCLUT11_GREEN_POSITION               0x00000008
#define _GLCDCLUT11_GREEN_MASK                   0x0000FF00
#define _GLCDCLUT11_GREEN_LENGTH                 0x00000008

#define _GLCDCLUT11_RED_POSITION                 0x00000010
#define _GLCDCLUT11_RED_MASK                     0x00FF0000
#define _GLCDCLUT11_RED_LENGTH                   0x00000008

#define _GLCDCLUT12_BLUE_POSITION                0x00000000
#define _GLCDCLUT12_BLUE_MASK                    0x000000FF
#define _GLCDCLUT12_BLUE_LENGTH                  0x00000008

#define _GLCDCLUT12_GREEN_POSITION               0x00000008
#define _GLCDCLUT12_GREEN_MASK                   0x0000FF00
#define _GLCDCLUT12_GREEN_LENGTH                 0x00000008

#define _GLCDCLUT12_RED_POSITION                 0x00000010
#define _GLCDCLUT12_RED_MASK                     0x00FF0000
#define _GLCDCLUT12_RED_LENGTH                   0x00000008

#define _GLCDCLUT13_BLUE_POSITION                0x00000000
#define _GLCDCLUT13_BLUE_MASK                    0x000000FF
#define _GLCDCLUT13_BLUE_LENGTH                  0x00000008

#define _GLCDCLUT13_GREEN_POSITION               0x00000008
#define _GLCDCLUT13_GREEN_MASK                   0x0000FF00
#define _GLCDCLUT13_GREEN_LENGTH                 0x00000008

#define _GLCDCLUT13_RED_POSITION                 0x00000010
#define _GLCDCLUT13_RED_MASK                     0x00FF0000
#define _GLCDCLUT13_RED_LENGTH                   0x00000008

#define _GLCDCLUT14_BLUE_POSITION                0x00000000
#define _GLCDCLUT14_BLUE_MASK                    0x000000FF
#define _GLCDCLUT14_BLUE_LENGTH                  0x00000008

#define _GLCDCLUT14_GREEN_POSITION               0x00000008
#define _GLCDCLUT14_GREEN_MASK                   0x0000FF00
#define _GLCDCLUT14_GREEN_LENGTH                 0x00000008

#define _GLCDCLUT14_RED_POSITION                 0x00000010
#define _GLCDCLUT14_RED_MASK                     0x00FF0000
#define _GLCDCLUT14_RED_LENGTH                   0x00000008

#define _GLCDCLUT15_BLUE_POSITION                0x00000000
#define _GLCDCLUT15_BLUE_MASK                    0x000000FF
#define _GLCDCLUT15_BLUE_LENGTH                  0x00000008

#define _GLCDCLUT15_GREEN_POSITION               0x00000008
#define _GLCDCLUT15_GREEN_MASK                   0x0000FF00
#define _GLCDCLUT15_GREEN_LENGTH                 0x00000008

#define _GLCDCLUT15_RED_POSITION                 0x00000010
#define _GLCDCLUT15_RED_MASK                     0x00FF0000
#define _GLCDCLUT15_RED_LENGTH                   0x00000008

#define _GLCDCLUT16_BLUE_POSITION                0x00000000
#define _GLCDCLUT16_BLUE_MASK                    0x000000FF
#define _GLCDCLUT16_BLUE_LENGTH                  0x00000008

#define _GLCDCLUT16_GREEN_POSITION               0x00000008
#define _GLCDCLUT16_GREEN_MASK                   0x0000FF00
#define _GLCDCLUT16_GREEN_LENGTH                 0x00000008

#define _GLCDCLUT16_RED_POSITION                 0x00000010
#define _GLCDCLUT16_RED_MASK                     0x00FF0000
#define _GLCDCLUT16_RED_LENGTH                   0x00000008

#define _GLCDCLUT17_BLUE_POSITION                0x00000000
#define _GLCDCLUT17_BLUE_MASK                    0x000000FF
#define _GLCDCLUT17_BLUE_LENGTH                  0x00000008

#define _GLCDCLUT17_GREEN_POSITION               0x00000008
#define _GLCDCLUT17_GREEN_MASK                   0x0000FF00
#define _GLCDCLUT17_GREEN_LENGTH                 0x00000008

#define _GLCDCLUT17_RED_POSITION                 0x00000010
#define _GLCDCLUT17_RED_MASK                     0x00FF0000
#define _GLCDCLUT17_RED_LENGTH                   0x00000008

#define _GLCDCLUT18_BLUE_POSITION                0x00000000
#define _GLCDCLUT18_BLUE_MASK                    0x000000FF
#define _GLCDCLUT18_BLUE_LENGTH                  0x00000008

#define _GLCDCLUT18_GREEN_POSITION               0x00000008
#define _GLCDCLUT18_GREEN_MASK                   0x0000FF00
#define _GLCDCLUT18_GREEN_LENGTH                 0x00000008

#define _GLCDCLUT18_RED_POSITION                 0x00000010
#define _GLCDCLUT18_RED_MASK                     0x00FF0000
#define _GLCDCLUT18_RED_LENGTH                   0x00000008

#define _GLCDCLUT19_BLUE_POSITION                0x00000000
#define _GLCDCLUT19_BLUE_MASK                    0x000000FF
#define _GLCDCLUT19_BLUE_LENGTH                  0x00000008

#define _GLCDCLUT19_GREEN_POSITION               0x00000008
#define _GLCDCLUT19_GREEN_MASK                   0x0000FF00
#define _GLCDCLUT19_GREEN_LENGTH                 0x00000008

#define _GLCDCLUT19_RED_POSITION                 0x00000010
#define _GLCDCLUT19_RED_MASK                     0x00FF0000
#define _GLCDCLUT19_RED_LENGTH                   0x00000008

#define _GLCDCLUT20_BLUE_POSITION                0x00000000
#define _GLCDCLUT20_BLUE_MASK                    0x000000FF
#define _GLCDCLUT20_BLUE_LENGTH                  0x00000008

#define _GLCDCLUT20_GREEN_POSITION               0x00000008
#define _GLCDCLUT20_GREEN_MASK                   0x0000FF00
#define _GLCDCLUT20_GREEN_LENGTH                 0x00000008

#define _GLCDCLUT20_RED_POSITION                 0x00000010
#define _GLCDCLUT20_RED_MASK                     0x00FF0000
#define _GLCDCLUT20_RED_LENGTH                   0x00000008

#define _GLCDCLUT21_BLUE_POSITION                0x00000000
#define _GLCDCLUT21_BLUE_MASK                    0x000000FF
#define _GLCDCLUT21_BLUE_LENGTH                  0x00000008

#define _GLCDCLUT21_GREEN_POSITION               0x00000008
#define _GLCDCLUT21_GREEN_MASK                   0x0000FF00
#define _GLCDCLUT21_GREEN_LENGTH                 0x00000008

#define _GLCDCLUT21_RED_POSITION                 0x00000010
#define _GLCDCLUT21_RED_MASK                     0x00FF0000
#define _GLCDCLUT21_RED_LENGTH                   0x00000008

